test/multiphaseEuler/heatTransferLimitedPhaseChange/waterEvaporation/system/continuity
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

libs            ("libutilityFunctionObjects.so");

type            coded;

writeControl    timeStep;
writeInterval   1;

codeOptions
#{
    -I$(LIB_SRC)/physicalProperties/lnInclude \
    -I$(LIB_SRC)/thermophysicalModels/specie/lnInclude \
    -I$(LIB_SRC)/thermophysicalModels/thermophysicalProperties/lnInclude \
    -I$(LIB_SRC)/thermophysicalModels/basic/lnInclude
#};

codeInclude
#{
    #include "rhoFluidThermo.H"

    namespace Foam
    {
        tmp<volScalarField> ea(const rhoFluidThermo& thermo)
        {
            return thermo.ha() - thermo.p()/thermo.rho();
        }
    }
#};

codeRead
#{
    volScalarField* dMass =
        new volScalarField
        (
            IOobject("dMass", mesh().time().name(), mesh()),
            mesh(),
            dimensionedScalar(dimMass/dimVolume, 0)
        );
    volScalarField* dMassGas = new volScalarField("dMass.steam", *dMass);
    volScalarField* mass0Gas = new volScalarField("mass0.steam", *dMass);
    volScalarField* dMassLiq = new volScalarField("dMass.water", *dMass);
    volScalarField* mass0Liq = new volScalarField("mass0.water", *dMass);
    volScalarField* dEnergy =
        new volScalarField
        (
            IOobject("dEnergy", mesh().time().name(), mesh()),
            mesh(),
            dimensionedScalar(dimEnergy/dimVolume, 0)
        );
    volScalarField* dEnergyLiq = new volScalarField("dEnergy.water", *dEnergy);
    volScalarField* energy0Liq = new volScalarField("energy0.water", *dEnergy);
    volScalarField* dEnergyGas = new volScalarField("dEnergy.steam", *dEnergy);
    volScalarField* energy0Gas = new volScalarField("energy0.steam", *dEnergy);

    const volScalarField& alphaGas =
        mesh().lookupObject<volScalarField>("alpha.steam");
    const volScalarField& alphaLiq =
        mesh().lookupObject<volScalarField>("alpha.water");
    const rhoFluidThermo& thermoGas =
        mesh().lookupObject<rhoFluidThermo>("physicalProperties.steam");
    const rhoFluidThermo& thermoLiq =
        mesh().lookupObject<rhoFluidThermo>("physicalProperties.water");

    *mass0Gas = alphaGas*thermoGas.rho();
    *mass0Liq = alphaLiq*thermoLiq.rho();

    // !!! Note that this is only a valid measure of energy
    // conservation because the case is of fixed volume and has no
    // kinetic energy
    *energy0Gas = alphaGas*thermoGas.rho()*ea(thermoGas);
    *energy0Liq = alphaLiq*thermoLiq.rho()*ea(thermoLiq);

    dMass->store();
    dMassGas->store();
    mass0Gas->store();
    dMassLiq->store();
    mass0Liq->store();
    dEnergy->store();
    dEnergyGas->store();
    energy0Gas->store();
    dEnergyLiq->store();
    energy0Liq->store();
#};

codeExecute
#{
    volScalarField& dMass =
        mesh().lookupObjectRef<volScalarField>("dMass");
    volScalarField& dMassGas =
        mesh().lookupObjectRef<volScalarField>("dMass.steam");
    const volScalarField& mass0Gas =
        mesh().lookupObject<volScalarField>("mass0.steam");
    volScalarField& dMassLiq =
        mesh().lookupObjectRef<volScalarField>("dMass.water");
    const volScalarField& mass0Liq =
        mesh().lookupObject<volScalarField>("mass0.water");

    volScalarField& dEnergy =
        mesh().lookupObjectRef<volScalarField>("dEnergy");
    volScalarField& dEnergyGas =
        mesh().lookupObjectRef<volScalarField>("dEnergy.steam");
    const volScalarField& energy0Gas =
        mesh().lookupObject<volScalarField>("energy0.steam");
    volScalarField& dEnergyLiq =
        mesh().lookupObjectRef<volScalarField>("dEnergy.water");
    const volScalarField& energy0Liq =
        mesh().lookupObject<volScalarField>("energy0.water");

    const volScalarField& alphaGas =
        mesh().lookupObject<volScalarField>("alpha.steam");
    const volScalarField& alphaLiq =
        mesh().lookupObject<volScalarField>("alpha.water");
    const rhoFluidThermo& thermoGas =
        mesh().lookupObject<rhoFluidThermo>("physicalProperties.steam");
    const rhoFluidThermo& thermoLiq =
        mesh().lookupObject<rhoFluidThermo>("physicalProperties.water");

    dMassGas = alphaGas*thermoGas.rho() - mass0Gas;
    dMassLiq = alphaLiq*thermoLiq.rho() - mass0Liq;
    dMass = dMassGas + dMassLiq;

    // !!! Note that this is only a valid measure of energy
    // conservation because the case is of fixed volume and has no
    // kinetic energy
    dEnergyGas = alphaGas*thermoGas.rho()*ea(thermoGas) - energy0Gas;
    dEnergyLiq = alphaLiq*thermoLiq.rho()*ea(thermoLiq) - energy0Liq;
    dEnergy = dEnergyGas + dEnergyLiq;
#};

// ************************************************************************* //
